v5 = 0.0000001

def prob(v2):
    v3 = 0.0
    v4 = 0.0
    while (v2 > v4):
        v6 = (v3 + 1.0) * (v4 + 1.0)
        v4 = v5 / 2.0 + v4
        v7 = (v6 * v5 / 2.0 + v3 + 1.0) * (v4 + 1.0)
        v8 = (v7 * v5 / 2.0 + v3 + 1.0) * (v4 + 1.0)
        v4 = v5 / 2.0 + v4
        v9 = (v5 * v8 + v3 + 1.0) * (v4 + 1.0)
        v3 = (v8 + v8 + v7 + v7 + v6 + v9) * v5 / 6.0 + v3
    return v3

l = 0; r = 1
while (l <= r):
    mid = (l + r) / 2
    # v2가 커지면 v3도 커짐
    res = prob(mid)
    print(mid, res)
    if abs(res - 1.604151184400547) <= v5:
        print(mid)
    elif res - 1.604151184400547 > 0:
        r = mid - 0.000000000000001
    elif res - 1.604151184400547:
        l = mid + 0.000000000000001

# 0.7071067094802861